// Singular integer right triangles
// Problem 75
// It turns out that 12 cm is the smallest length of wire that can be bent to form an integer sided right angle triangle in exactly one way, but there are many more examples.
// 
// 12 cm: (3,4,5)
// 24 cm: (6,8,10)
// 30 cm: (5,12,13)
// 36 cm: (9,12,15)
// 40 cm: (8,15,17)
// 48 cm: (12,16,20)
// 
// In contrast, some lengths of wire, like 20 cm, cannot be bent to form an integer sided right angle triangle, and other lengths allow more than one solution to be found; for example, using 120 cm it is possible to form exactly three different integer sided right angle triangles.
// 
// 120 cm: (30,40,50), (20,48,52), (24,45,51)
// 
// Given that L is the length of the wire, for how many values of L ≤ 1,500,000 can exactly one integer sided right angle triangle be formed?

#ifdef PROBLEM_NO
#undef PROBLEM_NO
#endif // PROBLEM_NO
#define PROBLEM_NO 75

#include <thread>
#include <list>
#include <atomic>

#include <Template.h>

#include <CppMath.h>

using namespace std;

namespace GET_NAMESPACE_NAME(PROBLEM_NO)
{
    // 当前模块用到的全局变量和全局函数放在此处

    // 获得线长l是否只能形成一个直角三角形
    // 这个用的是遍历的方法，比较耗时
    bool IsOneRightAngleTriangle(uint32_t l)
    {
        bool haveFound = false;

        // a=b<c，所以a应该是小于l/3的
        uint64_t maxA = l / 3;

        // a^2 + b^2 = c^2
        // a + b + c = l
        for (uint64_t a = 1; a < maxA; a++)
        {
            //     c>b 
            //  => l-a-b>b 
            //  => a+2b<l
            for (uint64_t b = a; a + (b << 1) < l; ++b)
            {
                uint64_t c = l - a - b;
                if (c * c == a * a + b * b)
                {
                    // DEBUG_LOG("%u=%u+%d+%u", l, a, b, c);

                    // 已经找到了，所以不止1个
                    if (haveFound)
                    {
                        return false;
                    }

                    haveFound = true;

                    // 这一组a的不可能有第二个解了，跳出好了
                    break;
                }
            }
        }

        return haveFound;
    }

    // 获得线长l是否只能形成一个直角三角形
    // 这个根据l和a的值和a,b,c之间的关系，算出b和l、a的关系，计算出b，如果b为整数，则成功
    bool IsOneRightAngleTrianglePro(uint32_t l)
    {
        bool haveFound = false;

        // a,b,c依次递增，所以a应该是小于l/3的
        uint64_t maxA = l / 3;

        // a^2 + b^2 = c^2
        // a + b + c = l
        // 所以b=l*(l-2*a)/2/(l-a)，如果b是整数，则OK
        for (uint64_t a = 1; a < maxA; ++a)
        {
            double b = (double)l * (l - 2 * a) / 2 / (l - a);

            // 70的时候会出现a是21，而b是20的情况，排除掉
            if (b < a)
            {
                continue;
            }

            int64_t bInt;
            if (CppMath::IsInt(b, 0.000001, bInt))
            {
                // 重新审核一遍
                uint64_t c = l - a - bInt;
                if (a * a + bInt * bInt != c * c)
                {
                    continue;
                }

                // DEBUG_LOG("%u=%u+%d+%u", l, a, bInt, c);

                // 已经找到了，所以不止1个
                if (haveFound)
                {
                    return false;
                }

                haveFound = true;
            }
        }

        return haveFound;
    }
}

using namespace GET_NAMESPACE_NAME(PROBLEM_NO);

/* 当前页面的构造函数，会在页面加载前调用，未请求的页面不会调用 */
GET_CLASS_NAME(PROBLEM_NO)::GET_CLASS_NAME(PROBLEM_NO)() : Problem()
{
}

/* 运行 */
string GET_CLASS_NAME(PROBLEM_NO)::Run()
{
    // 开THREAD_COUNT个线程做这件事
    static const uint32_t THREAD_COUNT = 7;
    static const uint32_t COUNT = 1500000;
    list<thread> threads;
    atomic<uint32_t> resultSum(0);
    atomic<uint32_t> currN(3);

    for (uint32_t i = 0; i < THREAD_COUNT; ++i)
    {
        thread th([&](uint32_t threadId)
        {
            uint32_t n;
            while ((n = currN.fetch_add(1)) <= COUNT)
            {
                if (IsOneRightAngleTrianglePro(n))
                {
                    // DEBUG_LOG("%u", n);
                    ++resultSum;
                }

                if (n % 15000 == 0)
                {
                    // 这里不一定是正确的结果，因为可能其他线程已经修改了resultSum
                    DEBUG_LOG("线程[%u]完成计算[%u],目前结果[%u].", threadId, n, resultSum.load());
                }
            }
        }, i);

        threads.push_back(move(th));
    }

    // 等待线程完成
    for (auto &th : threads)
    {
        th.join();
    }

    printf("线长小于等于[%u]一共有[%u]种长度的线仅能组成1个整数直角三角形.\n", COUNT, resultSum.load());
    return CppString::ToString(resultSum);
}

/* 析构函数：做当前页面的一些资源释放工作 */
GET_CLASS_NAME(PROBLEM_NO)::~GET_CLASS_NAME(PROBLEM_NO)()
{
    /* TODO */
}

/*
./ProjectEuler 75
[2016-12-17 16:03:54.955600]开始运行第75题.
[2016-12-17 16:03:55.131848][DEBUG]Problem075.cpp:158|线程[2]完成计算[15000],目前结果[1663].
[2016-12-17 16:03:55.638056][DEBUG]Problem075.cpp:158|线程[3]完成计算[30000],目前结果[3291].
[2016-12-17 16:03:56.445745][DEBUG]Problem075.cpp:158|线程[1]完成计算[45000],目前结果[4941].
[2016-12-17 16:03:57.528623][DEBUG]Problem075.cpp:158|线程[2]完成计算[60000],目前结果[6619].
[2016-12-17 16:03:58.904362][DEBUG]Problem075.cpp:158|线程[0]完成计算[75000],目前结果[8260].
[2016-12-17 16:04:00.730635][DEBUG]Problem075.cpp:158|线程[3]完成计算[90000],目前结果[9920].
[2016-12-17 16:04:03.376709][DEBUG]Problem075.cpp:158|线程[1]完成计算[105000],目前结果[11553].
[2016-12-17 16:04:06.237364][DEBUG]Problem075.cpp:158|线程[2]完成计算[120000],目前结果[13166].
[2016-12-17 16:04:10.275554][DEBUG]Problem075.cpp:158|线程[2]完成计算[135000],目前结果[14774].
[2016-12-17 16:04:14.375995][DEBUG]Problem075.cpp:158|线程[0]完成计算[150000],目前结果[16414].
[2016-12-17 16:04:18.349942][DEBUG]Problem075.cpp:158|线程[0]完成计算[165000],目前结果[18085].
[2016-12-17 16:04:22.524090][DEBUG]Problem075.cpp:158|线程[3]完成计算[180000],目前结果[19728].
[2016-12-17 16:04:30.443987][DEBUG]Problem075.cpp:158|线程[2]完成计算[195000],目前结果[21401].
[2016-12-17 16:04:42.348046][DEBUG]Problem075.cpp:158|线程[0]完成计算[210000],目前结果[23071].
[2016-12-17 16:04:49.881494][DEBUG]Problem075.cpp:158|线程[3]完成计算[225000],目前结果[24712].
[2016-12-17 16:04:55.767331][DEBUG]Problem075.cpp:158|线程[2]完成计算[240000],目前结果[26377].
[2016-12-17 16:05:02.342896][DEBUG]Problem075.cpp:158|线程[2]完成计算[255000],目前结果[28028].
[2016-12-17 16:05:08.841935][DEBUG]Problem075.cpp:158|线程[2]完成计算[270000],目前结果[29673].
[2016-12-17 16:05:16.650705][DEBUG]Problem075.cpp:158|线程[2]完成计算[285000],目前结果[31308].
[2016-12-17 16:05:23.941314][DEBUG]Problem075.cpp:158|线程[3]完成计算[300000],目前结果[32930].
[2016-12-17 16:05:31.772868][DEBUG]Problem075.cpp:158|线程[1]完成计算[315000],目前结果[34543].
[2016-12-17 16:05:39.581613][DEBUG]Problem075.cpp:158|线程[0]完成计算[330000],目前结果[36158].
[2016-12-17 16:05:47.651318][DEBUG]Problem075.cpp:158|线程[2]完成计算[345000],目前结果[37761].
[2016-12-17 16:05:55.915357][DEBUG]Problem075.cpp:158|线程[2]完成计算[360000],目前结果[39352].
[2016-12-17 16:06:04.617925][DEBUG]Problem075.cpp:158|线程[2]完成计算[375000],目前结果[40970].
[2016-12-17 16:06:13.827680][DEBUG]Problem075.cpp:158|线程[1]完成计算[390000],目前结果[42575].
[2016-12-17 16:06:23.227173][DEBUG]Problem075.cpp:158|线程[0]完成计算[405000],目前结果[44163].
[2016-12-17 16:06:33.548395][DEBUG]Problem075.cpp:158|线程[2]完成计算[420000],目前结果[45815].
[2016-12-17 16:06:45.660658][DEBUG]Problem075.cpp:158|线程[2]完成计算[435000],目前结果[47410].
[2016-12-17 16:06:57.299744][DEBUG]Problem075.cpp:158|线程[2]完成计算[450000],目前结果[49053].
[2016-12-17 16:07:09.201919][DEBUG]Problem075.cpp:158|线程[0]完成计算[465000],目前结果[50671].
[2016-12-17 16:07:20.901441][DEBUG]Problem075.cpp:158|线程[3]完成计算[480000],目前结果[52293].
[2016-12-17 16:07:32.065530][DEBUG]Problem075.cpp:158|线程[3]完成计算[495000],目前结果[53913].
[2016-12-17 16:07:43.416554][DEBUG]Problem075.cpp:158|线程[2]完成计算[510000],目前结果[55516].
[2016-12-17 16:07:55.018584][DEBUG]Problem075.cpp:158|线程[0]完成计算[525000],目前结果[57116].
[2016-12-17 16:08:06.729763][DEBUG]Problem075.cpp:158|线程[3]完成计算[540000],目前结果[58738].
[2016-12-17 16:08:18.596739][DEBUG]Problem075.cpp:158|线程[2]完成计算[555000],目前结果[60350].
[2016-12-17 16:08:31.540787][DEBUG]Problem075.cpp:158|线程[0]完成计算[570000],目前结果[61920].
[2016-12-17 16:08:44.763448][DEBUG]Problem075.cpp:158|线程[1]完成计算[585000],目前结果[63518].
[2016-12-17 16:08:58.167194][DEBUG]Problem075.cpp:158|线程[0]完成计算[600000],目前结果[65088].
[2016-12-17 16:09:23.773389][DEBUG]Problem075.cpp:158|线程[3]完成计算[615000],目前结果[66717].
[2016-12-17 16:09:50.232376][DEBUG]Problem075.cpp:158|线程[1]完成计算[630000],目前结果[68317].
[2016-12-17 16:10:08.280753][DEBUG]Problem075.cpp:158|线程[3]完成计算[645000],目前结果[69953].
[2016-12-17 16:10:26.960714][DEBUG]Problem075.cpp:158|线程[1]完成计算[660000],目前结果[71534].
[2016-12-17 16:10:45.333582][DEBUG]Problem075.cpp:158|线程[2]完成计算[675000],目前结果[73109].
[2016-12-17 16:11:14.543383][DEBUG]Problem075.cpp:158|线程[0]完成计算[690000],目前结果[74695].
[2016-12-17 16:11:39.111167][DEBUG]Problem075.cpp:158|线程[2]完成计算[705000],目前结果[76319].
[2016-12-17 16:11:57.278071][DEBUG]Problem075.cpp:158|线程[3]完成计算[720000],目前结果[77952].
[2016-12-17 16:12:20.975454][DEBUG]Problem075.cpp:158|线程[0]完成计算[735000],目前结果[79565].
[2016-12-17 16:12:51.055420][DEBUG]Problem075.cpp:158|线程[3]完成计算[750000],目前结果[81136].
[2016-12-17 16:13:17.214424][DEBUG]Problem075.cpp:158|线程[0]完成计算[765000],目前结果[82716].
[2016-12-17 16:13:44.724925][DEBUG]Problem075.cpp:158|线程[0]完成计算[780000],目前结果[84332].
[2016-12-17 16:14:11.834460][DEBUG]Problem075.cpp:158|线程[3]完成计算[795000],目前结果[85955].
[2016-12-17 16:14:38.308796][DEBUG]Problem075.cpp:158|线程[1]完成计算[810000],目前结果[87523].
[2016-12-17 16:15:05.391355][DEBUG]Problem075.cpp:158|线程[1]完成计算[825000],目前结果[89100].
[2016-12-17 16:15:34.203716][DEBUG]Problem075.cpp:158|线程[3]完成计算[840000],目前结果[90750].
[2016-12-17 16:16:03.952769][DEBUG]Problem075.cpp:158|线程[1]完成计算[855000],目前结果[92314].
[2016-12-17 16:16:35.200484][DEBUG]Problem075.cpp:158|线程[0]完成计算[870000],目前结果[93965].
[2016-12-17 16:17:05.475698][DEBUG]Problem075.cpp:158|线程[2]完成计算[885000],目前结果[95569].
[2016-12-17 16:17:37.846773][DEBUG]Problem075.cpp:158|线程[2]完成计算[900000],目前结果[97137].
[2016-12-17 16:18:13.092708][DEBUG]Problem075.cpp:158|线程[2]完成计算[915000],目前结果[98765].
[2016-12-17 16:18:45.306917][DEBUG]Problem075.cpp:158|线程[2]完成计算[930000],目前结果[100363].
[2016-12-17 16:19:20.545334][DEBUG]Problem075.cpp:158|线程[0]完成计算[945000],目前结果[101955].
[2016-12-17 16:19:47.570618][DEBUG]Problem075.cpp:158|线程[2]完成计算[960000],目前结果[103586].
[2016-12-17 16:20:17.137604][DEBUG]Problem075.cpp:158|线程[2]完成计算[975000],目前结果[105193].
[2016-12-17 16:20:50.864082][DEBUG]Problem075.cpp:158|线程[2]完成计算[990000],目前结果[106800].
[2016-12-17 16:21:20.133455][DEBUG]Problem075.cpp:158|线程[3]完成计算[1005000],目前结果[108405].
[2016-12-17 16:21:48.626213][DEBUG]Problem075.cpp:158|线程[0]完成计算[1020000],目前结果[110053].
[2016-12-17 16:22:16.397991][DEBUG]Problem075.cpp:158|线程[0]完成计算[1035000],目前结果[111695].
[2016-12-17 16:22:41.055176][DEBUG]Problem075.cpp:158|线程[3]完成计算[1050000],目前结果[113293].
[2016-12-17 16:23:07.402483][DEBUG]Problem075.cpp:158|线程[3]完成计算[1065000],目前结果[114881].
[2016-12-17 16:23:36.533507][DEBUG]Problem075.cpp:158|线程[1]完成计算[1080000],目前结果[116493].
[2016-12-17 16:24:10.047152][DEBUG]Problem075.cpp:158|线程[0]完成计算[1095000],目前结果[118102].
[2016-12-17 16:24:40.359914][DEBUG]Problem075.cpp:158|线程[1]完成计算[1110000],目前结果[119698].
[2016-12-17 16:25:16.168064][DEBUG]Problem075.cpp:158|线程[1]完成计算[1125000],目前结果[121338].
[2016-12-17 16:25:54.222689][DEBUG]Problem075.cpp:158|线程[3]完成计算[1140000],目前结果[122939].
[2016-12-17 16:26:29.129722][DEBUG]Problem075.cpp:158|线程[3]完成计算[1155000],目前结果[124545].
[2016-12-17 16:27:09.064197][DEBUG]Problem075.cpp:158|线程[0]完成计算[1170000],目前结果[126156].
[2016-12-17 16:27:54.160894][DEBUG]Problem075.cpp:158|线程[2]完成计算[1185000],目前结果[127738].
[2016-12-17 16:28:35.061176][DEBUG]Problem075.cpp:158|线程[0]完成计算[1200000],目前结果[129340].
[2016-12-17 16:29:11.373535][DEBUG]Problem075.cpp:158|线程[2]完成计算[1215000],目前结果[130977].
[2016-12-17 16:29:47.696187][DEBUG]Problem075.cpp:158|线程[2]完成计算[1230000],目前结果[132604].
[2016-12-17 16:30:27.296048][DEBUG]Problem075.cpp:158|线程[2]完成计算[1245000],目前结果[134218].
[2016-12-17 16:31:07.732519][DEBUG]Problem075.cpp:158|线程[3]完成计算[1260000],目前结果[135813].
[2016-12-17 16:32:04.599516][DEBUG]Problem075.cpp:158|线程[2]完成计算[1275000],目前结果[137467].
[2016-12-17 16:32:48.082654][DEBUG]Problem075.cpp:158|线程[0]完成计算[1290000],目前结果[139086].
[2016-12-17 16:33:27.319098][DEBUG]Problem075.cpp:158|线程[1]完成计算[1305000],目前结果[140688].
[2016-12-17 16:34:06.710014][DEBUG]Problem075.cpp:158|线程[0]完成计算[1320000],目前结果[142294].
[2016-12-17 16:34:50.211384][DEBUG]Problem075.cpp:158|线程[3]完成计算[1335000],目前结果[143913].
[2016-12-17 16:35:20.955292][DEBUG]Problem075.cpp:158|线程[0]完成计算[1350000],目前结果[145527].
[2016-12-17 16:35:53.737466][DEBUG]Problem075.cpp:158|线程[1]完成计算[1365000],目前结果[147135].
[2016-12-17 16:36:34.211423][DEBUG]Problem075.cpp:158|线程[0]完成计算[1380000],目前结果[148746].
[2016-12-17 16:37:48.457283][DEBUG]Problem075.cpp:158|线程[0]完成计算[1395000],目前结果[150372].
[2016-12-17 16:39:05.084613][DEBUG]Problem075.cpp:158|线程[1]完成计算[1410000],目前结果[151989].
[2016-12-17 16:40:22.361825][DEBUG]Problem075.cpp:158|线程[0]完成计算[1425000],目前结果[153616].
[2016-12-17 16:42:01.041113][DEBUG]Problem075.cpp:158|线程[2]完成计算[1440000],目前结果[155186].
[2016-12-17 16:43:43.520513][DEBUG]Problem075.cpp:158|线程[2]完成计算[1455000],目前结果[156801].
[2016-12-17 16:44:51.628457][DEBUG]Problem075.cpp:158|线程[1]完成计算[1470000],目前结果[158413].
[2016-12-17 16:46:24.673734][DEBUG]Problem075.cpp:158|线程[0]完成计算[1485000],目前结果[160038].
[2016-12-17 16:48:13.458308][DEBUG]Problem075.cpp:158|线程[1]完成计算[1500000],目前结果[161667].
线长小于等于[1500000]一共有[161667]种长度的线仅能组成1个整数直角三角形.
[2016-12-17 16:48:13.549546]第75题运行完毕，结果[161667]: From start 2658593946 us,from last 2658593946 us
By Moon
*/
