// Digit factorial chains
// Problem 74
// The number 145 is well known for the property that the sum of the factorial of its digits is equal to 145:
// 
// 1! + 4! + 5! = 1 + 24 + 120 = 145
// 
// Perhaps less well known is 169, in that it produces the longest chain of numbers that link back to 169; it turns out that there are only three such loops that exist:
// 
// 169 → 363601 → 1454 → 169
// 871 → 45361 → 871
// 872 → 45362 → 872
// 
// It is not difficult to prove that EVERY starting number will eventually get stuck in a loop. For example,
// 
// 69 → 363600 → 1454 → 169 → 363601 (→ 1454)
// 78 → 45360 → 871 → 45361 (→ 871)
// 540 → 145 (→ 145)
// 
// Starting with 69 produces a chain of five non-repeating terms, but the longest non-repeating chain with a starting number below one million is sixty terms.
// 
// How many chains, with a starting number below one million, contain exactly sixty non-repeating terms?

#ifdef PROBLEM_NO
#undef PROBLEM_NO
#endif // PROBLEM_NO
#define PROBLEM_NO 74

#include <thread>
#include <list>
#include <atomic>

#include <Template.h>

#include <CppMath.h>

using namespace std;

namespace GET_NAMESPACE_NAME(PROBLEM_NO)
{
    // 当前模块用到的全局变量和全局函数放在此处

    // 获得下一个各位阶乘和
    uint32_t GetNextFactorialSum(uint32_t n)
    {
        uint32_t sum = 0;
        while (n != 0)
        {
            sum += CppMath::FactorialWithCache(n % 10);
            n /= 10;
        }

        return sum;
    }

    // 获得阶乘链长度
    uint32_t GetFactorialCount(uint32_t n)
    {
        set<uint32_t> existsNum;        // 已经存在的数
        existsNum.insert(n);

        while (true)
        {
            n = GetNextFactorialSum(n);
            if (!existsNum.insert(n).second)
            {
                break;
            }
        }

        return existsNum.size();
    }
}

using namespace GET_NAMESPACE_NAME(PROBLEM_NO);

/* 当前页面的构造函数，会在页面加载前调用，未请求的页面不会调用 */
GET_CLASS_NAME(PROBLEM_NO)::GET_CLASS_NAME(PROBLEM_NO)() : Problem()
{
}

/* 运行 */
string GET_CLASS_NAME(PROBLEM_NO)::Run()
{
    // 开THREAD_COUNT个线程做这件事
    static const uint32_t THREAD_COUNT = 7;
    static const uint32_t COUNT = 1000000;
    static const uint32_t MAX_SIZE = 60;
    list<thread> threads;
    atomic<uint64_t> resultSum(0);
    atomic<uint32_t> currN(1);

    for (uint32_t i = 0; i < THREAD_COUNT; ++i)
    {
        thread th([&](uint32_t threadId)
        {
            uint32_t n;
            while ((n = currN.fetch_add(1)) <= COUNT)
            {
                //                 if (n % 10000 == 0)
                //                 {
                //                     printf("线程[%u]正在计算[%u]\n", threadId, n);
                //                 }

                if (GetFactorialCount(n) == MAX_SIZE)
                {
                    printf("[%u]的阶乘链长度为%u.\n", n, MAX_SIZE);
                    ++resultSum;
                }
            }
        }, i);

        threads.push_back(move(th));
    }

    // 等待线程完成
    for (auto &th : threads)
    {
        th.join();
    }

    printf("小于[%u]的数中阶乘链长度为%u的数一共有[%lu]个.\n", COUNT, MAX_SIZE, resultSum.load());
    return CppString::ToString(resultSum);
}

/* 析构函数：做当前页面的一些资源释放工作 */
GET_CLASS_NAME(PROBLEM_NO)::~GET_CLASS_NAME(PROBLEM_NO)()
{
    /* TODO */
}

/*
./ProjectEuler 74
[2016-12-16 16:51:04.159247]开始运行第74题.
[1479]的阶乘链长度为60.
[1497]的阶乘链长度为60.
[1749]的阶乘链长度为60.
[1794]的阶乘链长度为60.
[1947]的阶乘链长度为60.
[1974]的阶乘链长度为60.
[4079]的阶乘链长度为60.
[4097]的阶乘链长度为60.
[4179]的阶乘链长度为60.
[4197]的阶乘链长度为60.
[4709]的阶乘链长度为60.
[4719]的阶乘链长度为60.
[4790]的阶乘链长度为60.
[4791]的阶乘链长度为60.
[4907]的阶乘链长度为60.
[4917]的阶乘链长度为60.
[4970]的阶乘链长度为60.
[4971]的阶乘链长度为60.
[7049]的阶乘链长度为60.
[7094]的阶乘链长度为60.
[7149]的阶乘链长度为60.
[7194]的阶乘链长度为60.
[7409]的阶乘链长度为60.
[7419]的阶乘链长度为60.
[7490]的阶乘链长度为60.
[7491]的阶乘链长度为60.
[9047]的阶乘链长度为60.
[9147]的阶乘链长度为60.
[9174]的阶乘链长度为60.
[9417]的阶乘链长度为60.
[9470]的阶乘链长度为60.
[9471]的阶乘链长度为60.
[9704]的阶乘链长度为60.
[9074]的阶乘链长度为60.
[9714]的阶乘链长度为60.
[9740]的阶乘链长度为60.
[9407]的阶乘链长度为60.
[7904]的阶乘链长度为60.
[7914]的阶乘链长度为60.
[9741]的阶乘链长度为60.
[7940]的阶乘链长度为60.
[7941]的阶乘链长度为60.
[223479]的阶乘链长度为60.
[223749]的阶乘链长度为60.
[223794]的阶乘链长度为60.
[223947]的阶乘链长度为60.
[223974]的阶乘链长度为60.
[224379]的阶乘链长度为60.
[224397]的阶乘链长度为60.
[224739]的阶乘链长度为60.
[224793]的阶乘链长度为60.
[224937]的阶乘链长度为60.
[224973]的阶乘链长度为60.
[223497]的阶乘链长度为60.
[227349]的阶乘链长度为60.
[227394]的阶乘链长度为60.
[227439]的阶乘链长度为60.
[227493]的阶乘链长度为60.
[227934]的阶乘链长度为60.
[227943]的阶乘链长度为60.
[229347]的阶乘链长度为60.
[229374]的阶乘链长度为60.
[229437]的阶乘链长度为60.
[229473]的阶乘链长度为60.
[229734]的阶乘链长度为60.
[229743]的阶乘链长度为60.
[232479]的阶乘链长度为60.
[232497]的阶乘链长度为60.
[232749]的阶乘链长度为60.
[234279]的阶乘链长度为60.
[232947]的阶乘链长度为60.
[234927]的阶乘链长度为60.
[234972]的阶乘链长度为60.
[232974]的阶乘链长度为60.
[234297]的阶乘链长度为60.
[234729]的阶乘链长度为60.
[237249]的阶乘链长度为60.
[237294]的阶乘链长度为60.
[237429]的阶乘链长度为60.
[237492]的阶乘链长度为60.
[237924]的阶乘链长度为60.
[237942]的阶乘链长度为60.
[239247]的阶乘链长度为60.
[232794]的阶乘链长度为60.
[239724]的阶乘链长度为60.
[239742]的阶乘链长度为60.
[242379]的阶乘链长度为60.
[242397]的阶乘链长度为60.
[242739]的阶乘链长度为60.
[242793]的阶乘链长度为60.
[242937]的阶乘链长度为60.
[242973]的阶乘链长度为60.
[239274]的阶乘链长度为60.
[234792]的阶乘链长度为60.
[243279]的阶乘链长度为60.
[243297]的阶乘链长度为60.
[243729]的阶乘链长度为60.
[243792]的阶乘链长度为60.
[243927]的阶乘链长度为60.
[243972]的阶乘链长度为60.
[239427]的阶乘链长度为60.
[239472]的阶乘链长度为60.
[247239]的阶乘链长度为60.
[247293]的阶乘链长度为60.
[247329]的阶乘链长度为60.
[247392]的阶乘链长度为60.
[247923]的阶乘链长度为60.
[247932]的阶乘链长度为60.
[249237]的阶乘链长度为60.
[249327]的阶乘链长度为60.
[249372]的阶乘链长度为60.
[249723]的阶乘链长度为60.
[249732]的阶乘链长度为60.
[249273]的阶乘链长度为60.
[272349]的阶乘链长度为60.
[272394]的阶乘链长度为60.
[272439]的阶乘链长度为60.
[272493]的阶乘链长度为60.
[272934]的阶乘链长度为60.
[272943]的阶乘链长度为60.
[273249]的阶乘链长度为60.
[273294]的阶乘链长度为60.
[273429]的阶乘链长度为60.
[273492]的阶乘链长度为60.
[273924]的阶乘链长度为60.
[273942]的阶乘链长度为60.
[274239]的阶乘链长度为60.
[274293]的阶乘链长度为60.
[274329]的阶乘链长度为60.
[274392]的阶乘链长度为60.
[274923]的阶乘链长度为60.
[274932]的阶乘链长度为60.
[279234]的阶乘链长度为60.
[279243]的阶乘链长度为60.
[279324]的阶乘链长度为60.
[279342]的阶乘链长度为60.
[279423]的阶乘链长度为60.
[279432]的阶乘链长度为60.
[292347]的阶乘链长度为60.
[292374]的阶乘链长度为60.
[292437]的阶乘链长度为60.
[292473]的阶乘链长度为60.
[292734]的阶乘链长度为60.
[292743]的阶乘链长度为60.
[293247]的阶乘链长度为60.
[293274]的阶乘链长度为60.
[293427]的阶乘链长度为60.
[293472]的阶乘链长度为60.
[293724]的阶乘链长度为60.
[293742]的阶乘链长度为60.
[294237]的阶乘链长度为60.
[294273]的阶乘链长度为60.
[294327]的阶乘链长度为60.
[294372]的阶乘链长度为60.
[294723]的阶乘链长度为60.
[294732]的阶乘链长度为60.
[297234]的阶乘链长度为60.
[297324]的阶乘链长度为60.
[297423]的阶乘链长度为60.
[297432]的阶乘链长度为60.
[297243]的阶乘链长度为60.
[297342]的阶乘链长度为60.
[322479]的阶乘链长度为60.
[322497]的阶乘链长度为60.
[322749]的阶乘链长度为60.
[322794]的阶乘链长度为60.
[322947]的阶乘链长度为60.
[322974]的阶乘链长度为60.
[324279]的阶乘链长度为60.
[324297]的阶乘链长度为60.
[324729]的阶乘链长度为60.
[324792]的阶乘链长度为60.
[324927]的阶乘链长度为60.
[324972]的阶乘链长度为60.
[327249]的阶乘链长度为60.
[327294]的阶乘链长度为60.
[327429]的阶乘链长度为60.
[327924]的阶乘链长度为60.
[327942]的阶乘链长度为60.
[327492]的阶乘链长度为60.
[329247]的阶乘链长度为60.
[329274]的阶乘链长度为60.
[329427]的阶乘链长度为60.
[329472]的阶乘链长度为60.
[329724]的阶乘链长度为60.
[329742]的阶乘链长度为60.
[342279]的阶乘链长度为60.
[342297]的阶乘链长度为60.
[342729]的阶乘链长度为60.
[342792]的阶乘链长度为60.
[342927]的阶乘链长度为60.
[342972]的阶乘链长度为60.
[347229]的阶乘链长度为60.
[347292]的阶乘链长度为60.
[347922]的阶乘链长度为60.
[349227]的阶乘链长度为60.
[349272]的阶乘链长度为60.
[349722]的阶乘链长度为60.
[372249]的阶乘链长度为60.
[372294]的阶乘链长度为60.
[372429]的阶乘链长度为60.
[372492]的阶乘链长度为60.
[372924]的阶乘链长度为60.
[372942]的阶乘链长度为60.
[374229]的阶乘链长度为60.
[374292]的阶乘链长度为60.
[374922]的阶乘链长度为60.
[379224]的阶乘链长度为60.
[379242]的阶乘链长度为60.
[392247]的阶乘链长度为60.
[392427]的阶乘链长度为60.
[392472]的阶乘链长度为60.
[392724]的阶乘链长度为60.
[392274]的阶乘链长度为60.
[379422]的阶乘链长度为60.
[392742]的阶乘链长度为60.
[394227]的阶乘链长度为60.
[394722]的阶乘链长度为60.
[394272]的阶乘链长度为60.
[397224]的阶乘链长度为60.
[397422]的阶乘链长度为60.
[397242]的阶乘链长度为60.
[422379]的阶乘链长度为60.
[422397]的阶乘链长度为60.
[422739]的阶乘链长度为60.
[422793]的阶乘链长度为60.
[422937]的阶乘链长度为60.
[422973]的阶乘链长度为60.
[423279]的阶乘链长度为60.
[423297]的阶乘链长度为60.
[423729]的阶乘链长度为60.
[423792]的阶乘链长度为60.
[423927]的阶乘链长度为60.
[423972]的阶乘链长度为60.
[427239]的阶乘链长度为60.
[427293]的阶乘链长度为60.
[427392]的阶乘链长度为60.
[427923]的阶乘链长度为60.
[427329]的阶乘链长度为60.
[427932]的阶乘链长度为60.
[429237]的阶乘链长度为60.
[429273]的阶乘链长度为60.
[429327]的阶乘链长度为60.
[429372]的阶乘链长度为60.
[429723]的阶乘链长度为60.
[429732]的阶乘链长度为60.
[432279]的阶乘链长度为60.
[432297]的阶乘链长度为60.
[432729]的阶乘链长度为60.
[432792]的阶乘链长度为60.
[432927]的阶乘链长度为60.
[432972]的阶乘链长度为60.
[437229]的阶乘链长度为60.
[437292]的阶乘链长度为60.
[437922]的阶乘链长度为60.
[439227]的阶乘链长度为60.
[439272]的阶乘链长度为60.
[439722]的阶乘链长度为60.
[472239]的阶乘链长度为60.
[472923]的阶乘链长度为60.
[472932]的阶乘链长度为60.
[473229]的阶乘链长度为60.
[473292]的阶乘链长度为60.
[473922]的阶乘链长度为60.
[472293]的阶乘链长度为60.
[472329]的阶乘链长度为60.
[472392]的阶乘链长度为60.
[479223]的阶乘链长度为60.
[479232]的阶乘链长度为60.
[479322]的阶乘链长度为60.
[492237]的阶乘链长度为60.
[492273]的阶乘链长度为60.
[492372]的阶乘链长度为60.
[492327]的阶乘链长度为60.
[492723]的阶乘链长度为60.
[492732]的阶乘链长度为60.
[493227]的阶乘链长度为60.
[493272]的阶乘链长度为60.
[493722]的阶乘链长度为60.
[497223]的阶乘链长度为60.
[497322]的阶乘链长度为60.
[497232]的阶乘链长度为60.
[722349]的阶乘链长度为60.
[722394]的阶乘链长度为60.
[722439]的阶乘链长度为60.
[722493]的阶乘链长度为60.
[722934]的阶乘链长度为60.
[722943]的阶乘链长度为60.
[723249]的阶乘链长度为60.
[723294]的阶乘链长度为60.
[723429]的阶乘链长度为60.
[723492]的阶乘链长度为60.
[723924]的阶乘链长度为60.
[724329]的阶乘链长度为60.
[724392]的阶乘链长度为60.
[724923]的阶乘链长度为60.
[724932]的阶乘链长度为60.
[723942]的阶乘链长度为60.
[724239]的阶乘链长度为60.
[729234]的阶乘链长度为60.
[729243]的阶乘链长度为60.
[724293]的阶乘链长度为60.
[729324]的阶乘链长度为60.
[729342]的阶乘链长度为60.
[729423]的阶乘链长度为60.
[729432]的阶乘链长度为60.
[732249]的阶乘链长度为60.
[732294]的阶乘链长度为60.
[732429]的阶乘链长度为60.
[732492]的阶乘链长度为60.
[732924]的阶乘链长度为60.
[732942]的阶乘链长度为60.
[734229]的阶乘链长度为60.
[734292]的阶乘链长度为60.
[734922]的阶乘链长度为60.
[739224]的阶乘链长度为60.
[739242]的阶乘链长度为60.
[739422]的阶乘链长度为60.
[742239]的阶乘链长度为60.
[742293]的阶乘链长度为60.
[742329]的阶乘链长度为60.
[742392]的阶乘链长度为60.
[742932]的阶乘链长度为60.
[743229]的阶乘链长度为60.
[743292]的阶乘链长度为60.
[743922]的阶乘链长度为60.
[742923]的阶乘链长度为60.
[749223]的阶乘链长度为60.
[749232]的阶乘链长度为60.
[749322]的阶乘链长度为60.
[792234]的阶乘链长度为60.
[792243]的阶乘链长度为60.
[792324]的阶乘链长度为60.
[792342]的阶乘链长度为60.
[792423]的阶乘链长度为60.
[794223]的阶乘链长度为60.
[794232]的阶乘链长度为60.
[794322]的阶乘链长度为60.
[792432]的阶乘链长度为60.
[793224]的阶乘链长度为60.
[793242]的阶乘链长度为60.
[793422]的阶乘链长度为60.
[922347]的阶乘链长度为60.
[922374]的阶乘链长度为60.
[923247]的阶乘链长度为60.
[923274]的阶乘链长度为60.
[923427]的阶乘链长度为60.
[923472]的阶乘链长度为60.
[923724]的阶乘链长度为60.
[923742]的阶乘链长度为60.
[924237]的阶乘链长度为60.
[922437]的阶乘链长度为60.
[924273]的阶乘链长度为60.
[924327]的阶乘链长度为60.
[924372]的阶乘链长度为60.
[924723]的阶乘链长度为60.
[924732]的阶乘链长度为60.
[927234]的阶乘链长度为60.
[927243]的阶乘链长度为60.
[927324]的阶乘链长度为60.
[927342]的阶乘链长度为60.
[927423]的阶乘链长度为60.
[927432]的阶乘链长度为60.
[922473]的阶乘链长度为60.
[922734]的阶乘链长度为60.
[922743]的阶乘链长度为60.
[932247]的阶乘链长度为60.
[932427]的阶乘链长度为60.
[932472]的阶乘链长度为60.
[932724]的阶乘链长度为60.
[932742]的阶乘链长度为60.
[932274]的阶乘链长度为60.
[934227]的阶乘链长度为60.
[934272]的阶乘链长度为60.
[934722]的阶乘链长度为60.
[937224]的阶乘链长度为60.
[937242]的阶乘链长度为60.
[937422]的阶乘链长度为60.
[942237]的阶乘链长度为60.
[942273]的阶乘链长度为60.
[942327]的阶乘链长度为60.
[942372]的阶乘链长度为60.
[942723]的阶乘链长度为60.
[942732]的阶乘链长度为60.
[943227]的阶乘链长度为60.
[943272]的阶乘链长度为60.
[943722]的阶乘链长度为60.
[947223]的阶乘链长度为60.
[947322]的阶乘链长度为60.
[947232]的阶乘链长度为60.
[972234]的阶乘链长度为60.
[972423]的阶乘链长度为60.
[972432]的阶乘链长度为60.
[972243]的阶乘链长度为60.
[973224]的阶乘链长度为60.
[973242]的阶乘链长度为60.
[972342]的阶乘链长度为60.
[973422]的阶乘链长度为60.
[972324]的阶乘链长度为60.
[974223]的阶乘链长度为60.
[974322]的阶乘链长度为60.
[974232]的阶乘链长度为60.
小于[1000000]的数中阶乘链长度为60的数一共有[402]个.
[2016-12-16 16:51:06.078049]第74题运行完毕，结果[402]: From start 1918802 us,from last 1918802 us
By Moon
*/
